src/app/controllers/pages_controller.rb

  def home
    # Get the top 5 listings which have been ordered the most.
    @popular_listings = Listing.order("orders_count DESC").limit(5)
---
SELECT  "listings".* FROM "listings" ORDER BY orders_count DESC LIMIT $1  [["LIMIT", 5]]