app/views/listings/_listing.html.erb

        <div class="media-content">
          <p class="title is-4"><%= link_to "#{listing.user.first_name} #{listing.user.middle_name[0]}. #{listing.user.last_name}", user_profile_path(listing.user) %></p>
---
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12)  [["id", 47], ["id", 24], ["id", 25], ["id", 44], ["id", 51], ["id", 13], ["id", 2], ["id", 17], ["id", 34], ["id", 37], ["id", 15], ["id", 50]]