src/app/views/pages/_popular_listing.html.erb

        <div class="media-content">
          <p class="title is-4"><%= link_to "#{popular_listing.user.first_name} #{popular_listing.user.middle_name[0]}. #{popular_listing.user.last_name}", user_profile_path(popular_listing.user) %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]