app/controllers/listings_controller.rb

SELECT  "listings".* FROM "listings" WHERE "listings"."active" = $1 LIMIT $2 OFFSET $3  [["active", true], ["LIMIT", 15], ["OFFSET", 0]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12)  [["id", 47], ["id", 24], ["id", 25], ["id", 44], ["id", 51], ["id", 13], ["id", 2], ["id", 17], ["id", 34], ["id", 37], ["id", 15], ["id", 50]]
SELECT COUNT(*) FROM "listings" WHERE "listings"."active" = $1  [["active", true]]
---
  def index
    # Get all of the listings in the database where the active columns has a value of true. Eager load
    # the user object as this will be accessed in the erb template.
    @listings = Listing.where(active:true).paginate(page: params[:page], per_page: 15).includes(:user)